linux/vps.org.html
<!DOCTYPE html>
<html>
  <head>
    <meta charset="utf8"></meta>
    <title>vps.org</title>
    <link rel="stylesheet" href="/diary/resources/css/main.css" />
    <link rel="stylesheet" href="/diary/resources/highlight/styles/default.css" />
  </head>
  <body>
    <section class="main-article-area">
      <nav id='content'>
	<span id="prev">
	  	
	  <a href="/diary/linux/suse.org.html">Prev: suse.org</a>
	  	
	</span>

	<span id="home"><a href="/diary">Home</a></span>
	<span id="Up">
	  
	  <a href="/diary/linux">Up: linux</a>
	  	
	</span>

	<span id="next">
	  	
	</span>
      </nav>
      
      <div id='main'>
	<h1 id="目标">目标</h1>
<p>有一个独立的 VPS 主机，使用 HEXO 搭建博客，并申请一个免费的 domain</p>
<h1 id="vps">VPS</h1>
<p>经过多方调查，在 vultr 和 banwango 之间选择。因为后者可以以支付宝付款，所以果断选择了后者</p>
<h2 id="系统">系统</h2>
<p>选择的是 debian8，默认是 centos7，切换起来不慢。</p>
<pre class="shell"><code>root@larry:~/node-v6.10.3# lsb_release -a
No LSB modules are available.
Distributor ID: Debian
Description:    Debian GNU/Linux 8.1 (jessie)
Release:        8.1
Codename:       jessie
</code></pre>
<h1 id="域名">域名</h1>
<p>虽然很想有一个靠谱的域名，长期拥有。但考虑到费用，而且应该以内容为重。所以选择了免费的<a href="http://www.dot.tk/zh/index.html"> dot.tk</a></p>
<h1 id="hexo">Hexo</h1>
<p>目前打算在 VPS 上作以下服务：</p>
<ol class="incremental">
<li>笔记， 使用 org-mode 来管理</li>
<li>Hexo，保存笔记，另一份在 <a href="http://larryzju.github.io">http://larryzju.github.io</a></li>
<li>其它</li>
</ol>
<h2 id="安装">安装</h2>
<pre class="shell"><code># apt-get install npm nodejs
# ln -s /usr/bin/nodejs /usr/local/bin/node
# npm install -g hexo-cli
</code></pre>
<h2 id="初始化">初始化</h2>
<pre class="shell"><code>$ hexo init blog
$ cd blog
$ npm install
$ hexo server
</code></pre>

      </div>
    </section>
  </body>
</html>
